# GraphicsStyle Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
GraphicsStyle Class
Members See Also
---
The graphics style instance in Autodesk Revit document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class GraphicsStyle : Element
```

Visual Basic
---
```text
Public Class GraphicsStyle _
	Inherits Element
```

Visual C++
---
```text
public ref class GraphicsStyle : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..GraphicsStyle
# See Also
GraphicsStyle Members
Autodesk.Revit.DB Namespace